Revit 2027 API
RebarConstrainedHandle.AllowsConstraintToHostEdgeCover Method
 Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdgeCover] type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowsConstraintToHostEdgeCover()
Public Function AllowsConstraintToHostEdgeCover As Boolean
public:
bool AllowsConstraintToHostEdgeCover()
member AllowsConstraintToHostEdgeCover : unit -> bool
Return Value
Boolean
 Returns true if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdgeCover] type.
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace